In [3]:
import pandas as pd

In [4]:
pd.read_csv("us_baby_names.csv")

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [5]:
us_babies = pd.read_csv("us_baby_names.csv")

In [6]:
us_babies

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [8]:
us_babies['Year']

0          1880
1          1880
2          1880
3          1880
4          1880
           ...
1825428    2014
1825429    2014
1825430    2014
1825431    2014
1825432    2014
Name: Year, Length: 1825433, dtype: int64

In [8]:
us_babies['Year']

0          1880
1          1880
2          1880
3          1880
4          1880
           ...
1825428    2014
1825429    2014
1825430    2014
1825431    2014
1825432    2014
Name: Year, Length: 1825433, dtype: int64

In [9]:
us_babies['Year']==2014

0          False
1          False
2          False
3          False
4          False
           ...
1825428     True
1825429     True
1825430     True
1825431     True
1825432     True
Name: Year, Length: 1825433, dtype: bool

In [2]:
us_babies_2014 = us_babies.loc (us_babies['Year'] ==2014, :)

SyntaxError: invalid syntax (Temp/ipykernel_11696/1336583030.py, line 1)

In [14]:
us_babies_2014 = us_babies.loc [us_babies['Year'] ==2014, :]

In [15]:
us_babies_2014

              Id      Name  Year Gender  Count
1792389  1792390      Emma  2014      F  20799
1792390  1792391    Olivia  2014      F  19674
1792391  1792392    Sophia  2014      F  18490
1792392  1792393  Isabella  2014      F  16950
1792393  1792394       Ava  2014      F  15586
...          ...       ...   ...    ...    ...
1825428  1825429    Zykeem  2014      M      5
1825429  1825430    Zymeer  2014      M      5
1825430  1825431   Zymiere  2014      M      5
1825431  1825432     Zyran  2014      M      5
1825432  1825433     Zyrin  2014      M      5

[33044 rows x 5 columns]

In [17]:
sorted_us_2014 = us_babies_2014.sort_values('count', ascending = false)

NameError: name 'false' is not defined

In [18]:
sorted_us_2014 = us_babies_2014.sort_values('count', ascending = false)

NameError: name 'false' is not defined

In [1]:
us_babies

NameError: name 'us_babies' is not defined

In [2]:
import pandas as pd

In [3]:
pd.read_csv("us_baby_names.csv")

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [4]:
us_babies = pd.read_csv("us_baby_names.csv")

In [5]:
us_babies

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [6]:
us_babies ['Year'] == 2013

0          False
1          False
2          False
3          False
4          False
           ...
1825428    False
1825429    False
1825430    False
1825431    False
1825432    False
Name: Year, Length: 1825433, dtype: bool

In [8]:
us_babies_2013 = us_babies.loc[us_babies['Year']== 2013, : us_babies_2013]

NameError: name 'us_babies_2013' is not defined

In [15]:
us_babies_2013 = us_babies.loc[us_babies['Year']== 2013, :

SyntaxError: unexpected EOF while parsing (Temp/ipykernel_11340/528420094.py, line 1)

In [10]:
us_babies

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [11]:
us_babies ['Year']== 1880

0           True
1           True
2           True
3           True
4           True
           ...
1825428    False
1825429    False
1825430    False
1825431    False
1825432    False
Name: Year, Length: 1825433, dtype: bool

In [12]:
us_babies_1880 = us_babies.loc[us_babies['Year']== 1880, : us_babies_1880]

NameError: name 'us_babies_1880' is not defined

In [13]:
us_babies_1880 = us_babies.loc [us_babies['Year'] ==1880, :]

In [14]:
us_babies_1880

        Id       Name  Year Gender  Count
0        1       Mary  1880      F   7065
1        2       Anna  1880      F   2604
2        3       Emma  1880      F   2003
3        4  Elizabeth  1880      F   1939
4        5     Minnie  1880      F   1746
...    ...        ...   ...    ...    ...
1995  1996     Woodie  1880      M      5
1996  1997     Worthy  1880      M      5
1997  1998     Wright  1880      M      5
1998  1999       York  1880      M      5
1999  2000  Zachariah  1880      M      5

[2000 rows x 5 columns]

In [16]:
us_babies ['Gender']

0          F
1          F
2          F
3          F
4          F
          ..
1825428    M
1825429    M
1825430    M
1825431    M
1825432    M
Name: Gender, Length: 1825433, dtype: object

In [19]:
sorted_us_babies_1880 = us_babies_1880.sort_Values('Count') decending = Female

SyntaxError: invalid syntax (Temp/ipykernel_11340/2235672996.py, line 1)

In [20]:
a = ('Gender')

In [22]:
print (a)

Gender

In [1]:
import pandas as pd

In [2]:
us_baby = pd.read_csv("us_baby_names.csv")

In [3]:
us_baby

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [4]:
us_baby ['Year']

0          1880
1          1880
2          1880
3          1880
4          1880
           ...
1825428    2014
1825429    2014
1825430    2014
1825431    2014
1825432    2014
Name: Year, Length: 1825433, dtype: int64

In [5]:
us_baby ['Year']==2013

0          False
1          False
2          False
3          False
4          False
           ...
1825428    False
1825429    False
1825430    False
1825431    False
1825432    False
Name: Year, Length: 1825433, dtype: bool

In [6]:
us_baby_2013 = us_baby.loc[us_baby('Year') ==2013]

TypeError: 'DataFrame' object is not callable

In [7]:
us_baby

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [9]:
us_baby ["Name"]

0               Mary
1               Anna
2               Emma
3          Elizabeth
4             Minnie
             ...
1825428       Zykeem
1825429       Zymeer
1825430      Zymiere
1825431        Zyran
1825432        Zyrin
Name: Name, Length: 1825433, dtype: object

In [15]:
us_baby_1880 = us_baby.loc[us_baby['Name']==1880, :]

In [16]:
us_baby_1880

Empty DataFrame
Columns: [Id, Name, Year, Gender, Count]
Index: []

In [17]:
us_baby

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [19]:
us_baby ['Name']

0               Mary
1               Anna
2               Emma
3          Elizabeth
4             Minnie
             ...
1825428       Zykeem
1825429       Zymeer
1825430      Zymiere
1825431        Zyran
1825432        Zyrin
Name: Name, Length: 1825433, dtype: object

In [22]:
us_baby ['Id']

0                1
1                2
2                3
3                4
4                5
            ...
1825428    1825429
1825429    1825430
1825430    1825431
1825431    1825432
1825432    1825433
Name: Id, Length: 1825433, dtype: int64

In [24]:
us_baby_2014 = us_baby.loc[us_baby['Year']== 2014, : us_baby_2014]

TypeError: 'Empty DataFrame
Columns: [Id, Name, Year, Gender, Count]
Index: []' is an invalid key

In [25]:
impprt pandas as pd

SyntaxError: invalid syntax (Temp/ipykernel_8144/2038757359.py, line 1)

In [1]:
import pandas as pd

In [3]:
us_baby = pd. read_csv('us_baby_names.csv')

In [4]:
us_baby

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [5]:
us_baby ['Year']==2014

0          False
1          False
2          False
3          False
4          False
           ...
1825428     True
1825429     True
1825430     True
1825431     True
1825432     True
Name: Year, Length: 1825433, dtype: bool

In [6]:
us_baby ['Name'] ==2014

0          False
1          False
2          False
3          False
4          False
           ...
1825428    False
1825429    False
1825430    False
1825431    False
1825432    False
Name: Name, Length: 1825433, dtype: bool

In [7]:
print_['us_baby_names']

NameError: name 'print_' is not defined

In [9]:
us_baby ["Year"]==2002

0          False
1          False
2          False
3          False
4          False
           ...
1825428    False
1825429    False
1825430    False
1825431    False
1825432    False
Name: Year, Length: 1825433, dtype: bool

In [10]:
us_baby ['Name'] ==2004

0          False
1          False
2          False
3          False
4          False
           ...
1825428    False
1825429    False
1825430    False
1825431    False
1825432    False
Name: Name, Length: 1825433, dtype: bool

In [11]:
define ['Year'] == 2008

NameError: name 'define' is not defined

In [12]:
print 'Francis'

SyntaxError: Missing parentheses in call to 'print'. Did you mean print('Francis')? (Temp/ipykernel_8788/433751819.py, line 1)

In [1]:
import pandas as pd

In [6]:
pd.read_csv("us_baby_names.csv")

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [7]:
names = pd.read_csv("us_baby_names.csv")

In [8]:
names

              Id       Name  Year Gender  Count
0              1       Mary  1880      F   7065
1              2       Anna  1880      F   2604
2              3       Emma  1880      F   2003
3              4  Elizabeth  1880      F   1939
4              5     Minnie  1880      F   1746
...          ...        ...   ...    ...    ...
1825428  1825429     Zykeem  2014      M      5
1825429  1825430     Zymeer  2014      M      5
1825430  1825431    Zymiere  2014      M      5
1825431  1825432      Zyran  2014      M      5
1825432  1825433      Zyrin  2014      M      5

[1825433 rows x 5 columns]

In [9]:
names.isnull ()

            Id   Name   Year  Gender  Count
0        False  False  False   False  False
1        False  False  False   False  False
2        False  False  False   False  False
3        False  False  False   False  False
4        False  False  False   False  False
...        ...    ...    ...     ...    ...
1825428  False  False  False   False  False
1825429  False  False  False   False  False
1825430  False  False  False   False  False
1825431  False  False  False   False  False
1825432  False  False  False   False  False

[1825433 rows x 5 columns]

In [10]:
names. isnull (). any (axis =1)

0          False
1          False
2          False
3          False
4          False
           ...
1825428    False
1825429    False
1825430    False
1825431    False
1825432    False
Length: 1825433, dtype: bool

In [11]:
row_missing_values = names. isnull (). any (axis =1) 
names[row_missing_values]

Empty DataFrame
Columns: [Id, Name, Year, Gender, Count]
Index: []

In [16]:
cleaned_names.drop(['Gender'])

KeyError: "['Gender'] not found in axis"

In [13]:
cleaned_name. unique

NameError: name 'cleaned_name' is not defined

In [14]:
cleaned_names =names

In [15]:
cleaned_names.drop(column= ['Gender'])

TypeError: drop() got an unexpected keyword argument 'column'

In [2]:
print ('hello world')

hello world

if 5 > 2
print ('five is greater than two')

In [3]:
print ('five is greater than two')

five is greater than two

In [6]:
if 5 > 2:
  print("Five is greater than two!")

Five is greater than two!

In [8]:
if 5 > 3:
   print('Five is greater than three!')

Five is greater than three!

In [9]:
if 6 < 9:
    print ('Six is less than seven!')

Six is less than seven!

In [17]:
x = 5
y = 'Hello'
print (y,x)

Hello 5

In [21]:
#this is a comment
print ('Jennifer')

Jennifer

##### x = 4
x = "Sally"
print (x)

In [26]:
x = 9
y = 'david Jackson'
print (y,x)

david Jackson 9

In [29]:
a = 3
A = 4
print (a, A)

3 4

In [30]:
exit ()

In [2]:
x, y, z = "mango", "Beans", "Tomato"
print (x,y,z)x

mango Beans Tomato

In [3]:
a, b, c = 2, 8, 7
print (a,b,c)

2 8 7

In [4]:
fruits = ['mango', "beans", "salad"]
x = fruits
print (fruits)

['mango', 'beans', 'salad']

In [13]:
x = 'python '
y= 'is '
z= 'awesome '
print (x+y+z)

python is awesome

In [18]:
x = "awesome"

def myfunc():
  print("Python is " + x)

myfunc()

Python is awesome

In [35]:
x = "love"

def myfunc():
 print("python is " + x)
    
myfunc()

python is love

In [40]:
x = 5j
print (type(x))

<class 'complex'>